<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="3" name="speech" type="Parameter" version="opset1">
			<data shape="?,?,560" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="speech">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="speech_lengths" type="Parameter" version="opset1">
			<data shape="?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="speech_lengths">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="language" type="Parameter" version="opset1">
			<data shape="?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="/Cast_output_0,language">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="textnorm" type="Parameter" version="opset1">
			<data shape="?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="/Cast_1_output_0,textnorm">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="/encoder/Constant_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" names="/encoder/Constant_output_0" />
			</output>
		</layer>
		<layer id="5" name="/encoder/Constant" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="6" name="Constant_41610" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="/Add_1_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_972" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="6" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/encoder/ReduceMax" type="ReduceMax" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="/encoder/ReduceMax_output_0" />
			</output>
		</layer>
		<layer id="10" name="/encoder/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/Cast_output_0" />
			</output>
		</layer>
		<layer id="11" name="/encoder/Constant_1_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="14" size="2" />
			<output>
				<port id="0" precision="FP16" names="/encoder/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="12" name="/encoder/Constant_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="13" name="/encoder/Range" type="Range" version="opset4">
			<data output_type="f32" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/encoder/Range_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/encoder/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/encoder/Cast_1_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/encoder/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="16" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/encoder/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="/encoder/Unsqueeze_output_0">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/encoder/Cast_2" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/encoder/Cast_2_output_0">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/encoder/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/encoder/Less_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/encoder/Cast_3" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/Cast_3_output_0,/encoder/Cast_4_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/encoder/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/encoder/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/Unsqueeze_1_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/encoder/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/encoder/Squeeze" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/Squeeze_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_3085" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" names="onnx::ReduceSum_1127">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/encoder/ReduceSum" type="ReduceSum" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/ReduceSum_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="encoder_out_lens" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32" names="encoder_out_lens">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_42248_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 25055" offset="32" size="50110" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>25055</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_42248" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>25055</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>25055</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_41618_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 512" offset="50142" size="1024" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_41618" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/encoder/encoders0.0/self_attn/Constant_14" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/encoders0.0/self_attn/Constant_14_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/encoder/encoders0.0/self_attn/Unsqueeze_7" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/encoders0.0/self_attn/Unsqueeze_7_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_41611_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_41611" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/encoder/encoders0.0/self_attn/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="/encoder/encoders.0/self_attn/Cast_1_output_0,/encoder/encoders.0/self_attn/Cast_output_0,/encoder/encoders.1/self_attn/Cast_1_output_0,/encoder/encoders.1/self_attn/Cast_output_0,/encoder/encoders.10/self_attn/Cast_1_output_0,/encoder/encoders.10/self_attn/Cast_output_0,/encoder/encoders.11/self_attn/Cast_1_output_0,/encoder/encoders.11/self_attn/Cast_output_0,/encoder/encoders.12/self_attn/Cast_1_output_0,/encoder/encoders.12/self_attn/Cast_output_0,/encoder/encoders.13/self_attn/Cast_1_output_0,/encoder/encoders.13/self_attn/Cast_output_0,/encoder/encoders.14/self_attn/Cast_1_output_0,/encoder/encoders.14/self_attn/Cast_output_0,/encoder/encoders.15/self_attn/Cast_1_output_0,/encoder/encoders.15/self_attn/Cast_output_0,/encoder/encoders.16/self_attn/Cast_1_output_0,/encoder/encoders.16/self_attn/Cast_output_0,/encoder/encoders.17/self_attn/Cast_1_output_0,/encoder/encoders.17/self_attn/Cast_output_0,/encoder/encoders.18/self_attn/Cast_1_output_0,/encoder/encoders.18/self_attn/Cast_output_0,/encoder/encoders.19/self_attn/Cast_1_output_0,/encoder/encoders.19/self_attn/Cast_output_0,/encoder/encoders.2/self_attn/Cast_1_output_0,/encoder/encoders.2/self_attn/Cast_output_0,/encoder/encoders.20/self_attn/Cast_1_output_0,/encoder/encoders.20/self_attn/Cast_output_0,/encoder/encoders.21/self_attn/Cast_1_output_0,/encoder/encoders.21/self_attn/Cast_output_0,/encoder/encoders.22/self_attn/Cast_1_output_0,/encoder/encoders.22/self_attn/Cast_output_0,/encoder/encoders.23/self_attn/Cast_1_output_0,/encoder/encoders.23/self_attn/Cast_output_0,/encoder/encoders.24/self_attn/Cast_1_output_0,/encoder/encoders.24/self_attn/Cast_output_0,/encoder/encoders.25/self_attn/Cast_1_output_0,/encoder/encoders.25/self_attn/Cast_output_0,/encoder/encoders.26/self_attn/Cast_1_output_0,/encoder/encoders.26/self_attn/Cast_output_0,/encoder/encoders.27/self_attn/Cast_1_output_0,/encoder/encoders.27/self_attn/Cast_output_0,/encoder/encoders.28/self_attn/Cast_1_output_0,/encoder/encoders.28/self_attn/Cast_output_0,/encoder/encoders.29/self_attn/Cast_1_output_0,/encoder/encoders.29/self_attn/Cast_output_0,/encoder/encoders.3/self_attn/Cast_1_output_0,/encoder/encoders.3/self_attn/Cast_output_0,/encoder/encoders.30/self_attn/Cast_1_output_0,/encoder/encoders.30/self_attn/Cast_output_0,/encoder/encoders.31/self_attn/Cast_1_output_0,/encoder/encoders.31/self_attn/Cast_output_0,/encoder/encoders.32/self_attn/Cast_1_output_0,/encoder/encoders.32/self_attn/Cast_output_0,/encoder/encoders.33/self_attn/Cast_1_output_0,/encoder/encoders.33/self_attn/Cast_output_0,/encoder/encoders.34/self_attn/Cast_1_output_0,/encoder/encoders.34/self_attn/Cast_output_0,/encoder/encoders.35/self_attn/Cast_1_output_0,/encoder/encoders.35/self_attn/Cast_output_0,/encoder/encoders.36/self_attn/Cast_1_output_0,/encoder/encoders.36/self_attn/Cast_output_0,/encoder/encoders.37/self_attn/Cast_1_output_0,/encoder/encoders.37/self_attn/Cast_output_0,/encoder/encoders.38/self_attn/Cast_1_output_0,/encoder/encoders.38/self_attn/Cast_output_0,/encoder/encoders.39/self_attn/Cast_1_output_0,/encoder/encoders.39/self_attn/Cast_output_0,/encoder/encoders.4/self_attn/Cast_1_output_0,/encoder/encoders.4/self_attn/Cast_output_0,/encoder/encoders.40/self_attn/Cast_1_output_0,/encoder/encoders.40/self_attn/Cast_output_0,/encoder/encoders.41/self_attn/Cast_1_output_0,/encoder/encoders.41/self_attn/Cast_output_0,/encoder/encoders.42/self_attn/Cast_1_output_0,/encoder/encoders.42/self_attn/Cast_output_0,/encoder/encoders.43/self_attn/Cast_1_output_0,/encoder/encoders.43/self_attn/Cast_output_0,/encoder/encoders.44/self_attn/Cast_1_output_0,/encoder/encoders.44/self_attn/Cast_output_0,/encoder/encoders.45/self_attn/Cast_1_output_0,/encoder/encoders.45/self_attn/Cast_output_0,/encoder/encoders.46/self_attn/Cast_1_output_0,/encoder/encoders.46/self_attn/Cast_output_0,/encoder/encoders.47/self_attn/Cast_1_output_0,/encoder/encoders.47/self_attn/Cast_output_0,/encoder/encoders.48/self_attn/Cast_1_output_0,/encoder/encoders.48/self_attn/Cast_output_0,/encoder/encoders.5/self_attn/Cast_1_output_0,/encoder/encoders.5/self_attn/Cast_output_0,/encoder/encoders.6/self_attn/Cast_1_output_0,/encoder/encoders.6/self_attn/Cast_output_0,/encoder/encoders.7/self_attn/Cast_1_output_0,/encoder/encoders.7/self_attn/Cast_output_0,/encoder/encoders.8/self_attn/Cast_1_output_0,/encoder/encoders.8/self_attn/Cast_output_0,/encoder/encoders.9/self_attn/Cast_1_output_0,/encoder/encoders.9/self_attn/Cast_output_0,/encoder/encoders0.0/self_attn/Cast_1_output_0,/encoder/encoders0.0/self_attn/Cast_output_0,/encoder/encoders0.0/self_attn/Equal_output_0,/encoder/tp_encoders.0/self_attn/Cast_1_output_0,/encoder/tp_encoders.0/self_attn/Cast_output_0,/encoder/tp_encoders.1/self_attn/Cast_1_output_0,/encoder/tp_encoders.1/self_attn/Cast_output_0,/encoder/tp_encoders.10/self_attn/Cast_1_output_0,/encoder/tp_encoders.10/self_attn/Cast_output_0,/encoder/tp_encoders.11/self_attn/Cast_1_output_0,/encoder/tp_encoders.11/self_attn/Cast_output_0,/encoder/tp_encoders.12/self_attn/Cast_1_output_0,/encoder/tp_encoders.12/self_attn/Cast_output_0,/encoder/tp_encoders.13/self_attn/Cast_1_output_0,/encoder/tp_encoders.13/self_attn/Cast_output_0,/encoder/tp_encoders.14/self_attn/Cast_1_output_0,/encoder/tp_encoders.14/self_attn/Cast_output_0,/encoder/tp_encoders.15/self_attn/Cast_1_output_0,/encoder/tp_encoders.15/self_attn/Cast_output_0,/encoder/tp_encoders.16/self_attn/Cast_1_output_0,/encoder/tp_encoders.16/self_attn/Cast_output_0,/encoder/tp_encoders.17/self_attn/Cast_1_output_0,/encoder/tp_encoders.17/self_attn/Cast_output_0,/encoder/tp_encoders.18/self_attn/Cast_1_output_0,/encoder/tp_encoders.18/self_attn/Cast_output_0,/encoder/tp_encoders.19/self_attn/Cast_1_output_0,/encoder/tp_encoders.19/self_attn/Cast_output_0,/encoder/tp_encoders.2/self_attn/Cast_1_output_0,/encoder/tp_encoders.2/self_attn/Cast_output_0,/encoder/tp_encoders.3/self_attn/Cast_1_output_0,/encoder/tp_encoders.3/self_attn/Cast_output_0,/encoder/tp_encoders.4/self_attn/Cast_1_output_0,/encoder/tp_encoders.4/self_attn/Cast_output_0,/encoder/tp_encoders.5/self_attn/Cast_1_output_0,/encoder/tp_encoders.5/self_attn/Cast_output_0,/encoder/tp_encoders.6/self_attn/Cast_1_output_0,/encoder/tp_encoders.6/self_attn/Cast_output_0,/encoder/tp_encoders.7/self_attn/Cast_1_output_0,/encoder/tp_encoders.7/self_attn/Cast_output_0,/encoder/tp_encoders.8/self_attn/Cast_1_output_0,/encoder/tp_encoders.8/self_attn/Cast_output_0,/encoder/tp_encoders.9/self_attn/Cast_1_output_0,/encoder/tp_encoders.9/self_attn/Cast_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/encoder/encoders0.0/self_attn/Constant_17_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" names="/encoder/encoders0.0/self_attn/Constant_17_output_0" />
			</output>
		</layer>
		<layer id="38" name="/encoder/encoders0.0/self_attn/Constant_17" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="39" name="/encoder/encoders0.0/self_attn/Constant_16" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="51166" size="4" />
			<output>
				<port id="0" precision="FP32" names="/encoder/encoders0.0/self_attn/Constant_16_output_0" />
			</output>
		</layer>
		<layer id="40" name="Constant_41616_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1536" offset="51170" size="3072" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_41616" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="embed.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 560" offset="54242" size="17920" />
			<output>
				<port id="0" precision="FP16" names="embed.weight">
					<dim>16</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="embed.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_923" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="6" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="45" name="/embed/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>560</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/embed/Gather_output_0">
					<dim>-1</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>560</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Unsqueeze_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/Expand_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 2, 560" offset="72162" size="2240" />
			<output>
				<port id="0" precision="FP16" names="/Expand_output_0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/Expand" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_928" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="6" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="51" name="/embed_1/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>560</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="/embed_1/Gather_output_0">
					<dim>-1</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>560</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Unsqueeze_1_output_0">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>560</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Concat_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="ShapeOf_43174" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_43175" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="6" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Constant_43176" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="6" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="58" name="Gather_43177" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Gather_output_0,/Unsqueeze_2_output_0,/Unsqueeze_3_output_0,/encoder/encoders.0/self_attn/Gather_2_output_0,/encoder/encoders.0/self_attn/Gather_3_output_0,/encoder/encoders.0/self_attn/Unsqueeze_6_output_0,/encoder/encoders.0/self_attn/Unsqueeze_7_output_0,/encoder/encoders.1/self_attn/Gather_2_output_0,/encoder/encoders.1/self_attn/Gather_3_output_0,/encoder/encoders.1/self_attn/Unsqueeze_6_output_0,/encoder/encoders.1/self_attn/Unsqueeze_7_output_0,/encoder/encoders.10/self_attn/Gather_2_output_0,/encoder/encoders.10/self_attn/Gather_3_output_0,/encoder/encoders.10/self_attn/Unsqueeze_6_output_0,/encoder/encoders.10/self_attn/Unsqueeze_7_output_0,/encoder/encoders.11/self_attn/Gather_2_output_0,/encoder/encoders.11/self_attn/Gather_3_output_0,/encoder/encoders.11/self_attn/Unsqueeze_6_output_0,/encoder/encoders.11/self_attn/Unsqueeze_7_output_0,/encoder/encoders.12/self_attn/Gather_2_output_0,/encoder/encoders.12/self_attn/Gather_3_output_0,/encoder/encoders.12/self_attn/Unsqueeze_6_output_0,/encoder/encoders.12/self_attn/Unsqueeze_7_output_0,/encoder/encoders.13/self_attn/Gather_2_output_0,/encoder/encoders.13/self_attn/Gather_3_output_0,/encoder/encoders.13/self_attn/Unsqueeze_6_output_0,/encoder/encoders.13/self_attn/Unsqueeze_7_output_0,/encoder/encoders.14/self_attn/Gather_2_output_0,/encoder/encoders.14/self_attn/Gather_3_output_0,/encoder/encoders.14/self_attn/Unsqueeze_6_output_0,/encoder/encoders.14/self_attn/Unsqueeze_7_output_0,/encoder/encoders.15/self_attn/Gather_2_output_0,/encoder/encoders.15/self_attn/Gather_3_output_0,/encoder/encoders.15/self_attn/Unsqueeze_6_output_0,/encoder/encoders.15/self_attn/Unsqueeze_7_output_0,/encoder/encoders.16/self_attn/Gather_2_output_0,/encoder/encoders.16/self_attn/Gather_3_output_0,/encoder/encoders.16/self_attn/Unsqueeze_6_output_0,/encoder/encoders.16/self_attn/Unsqueeze_7_output_0,/encoder/encoders.17/self_attn/Gather_2_output_0,/encoder/encoders.17/self_attn/Gather_3_output_0,/encoder/encoders.17/self_attn/Unsqueeze_6_output_0,/encoder/encoders.17/self_attn/Unsqueeze_7_output_0,/encoder/encoders.18/self_attn/Gather_2_output_0,/encoder/encoders.18/self_attn/Gather_3_output_0,/encoder/encoders.18/self_attn/Unsqueeze_6_output_0,/encoder/encoders.18/self_attn/Unsqueeze_7_output_0,/encoder/encoders.19/self_attn/Gather_2_output_0,/encoder/encoders.19/self_attn/Gather_3_output_0,/encoder/encoders.19/self_attn/Unsqueeze_6_output_0,/encoder/encoders.19/self_attn/Unsqueeze_7_output_0,/encoder/encoders.2/self_attn/Gather_2_output_0,/encoder/encoders.2/self_attn/Gather_3_output_0,/encoder/encoders.2/self_attn/Unsqueeze_6_output_0,/encoder/encoders.2/self_attn/Unsqueeze_7_output_0,/encoder/encoders.20/self_attn/Gather_2_output_0,/encoder/encoders.20/self_attn/Gather_3_output_0,/encoder/encoders.20/self_attn/Unsqueeze_6_output_0,/encoder/encoders.20/self_attn/Unsqueeze_7_output_0,/encoder/encoders.21/self_attn/Gather_2_output_0,/encoder/encoders.21/self_attn/Gather_3_output_0,/encoder/encoders.21/self_attn/Unsqueeze_6_output_0,/encoder/encoders.21/self_attn/Unsqueeze_7_output_0,/encoder/encoders.22/self_attn/Gather_2_output_0,/encoder/encoders.22/self_attn/Gather_3_output_0,/encoder/encoders.22/self_attn/Unsqueeze_6_output_0,/encoder/encoders.22/self_attn/Unsqueeze_7_output_0,/encoder/encoders.23/self_attn/Gather_2_output_0,/encoder/encoders.23/self_attn/Gather_3_output_0,/encoder/encoders.23/self_attn/Unsqueeze_6_output_0,/encoder/encoders.23/self_attn/Unsqueeze_7_output_0,/encoder/encoders.24/self_attn/Gather_2_output_0,/encoder/encoders.24/self_attn/Gather_3_output_0,/encoder/encoders.24/self_attn/Unsqueeze_6_output_0,/encoder/encoders.24/self_attn/Unsqueeze_7_output_0,/encoder/encoders.25/self_attn/Gather_2_output_0,/encoder/encoders.25/self_attn/Gather_3_output_0,/encoder/encoders.25/self_attn/Unsqueeze_6_output_0,/encoder/encoders.25/self_attn/Unsqueeze_7_output_0,/encoder/encoders.26/self_attn/Gather_2_output_0,/encoder/encoders.26/self_attn/Gather_3_output_0,/encoder/encoders.26/self_attn/Unsqueeze_6_output_0,/encoder/encoders.26/self_attn/Unsqueeze_7_output_0,/encoder/encoders.27/self_attn/Gather_2_output_0,/encoder/encoders.27/self_attn/Gather_3_output_0,/encoder/encoders.27/self_attn/Unsqueeze_6_output_0,/encoder/encoders.27/self_attn/Unsqueeze_7_output_0,/encoder/encoders.28/self_attn/Gather_2_output_0,/encoder/encoders.28/self_attn/Gather_3_output_0,/encoder/encoders.28/self_attn/Unsqueeze_6_output_0,/encoder/encoders.28/self_attn/Unsqueeze_7_output_0,/encoder/encoders.29/self_attn/Gather_2_output_0,/encoder/encoders.29/self_attn/Gather_3_output_0,/encoder/encoders.29/self_attn/Unsqueeze_6_output_0,/encoder/encoders.29/self_attn/Unsqueeze_7_output_0,/encoder/encoders.3/self_attn/Gather_2_output_0,/encoder/encoders.3/self_attn/Gather_3_output_0,/encoder/encoders.3/self_attn/Unsqueeze_6_output_0,/encoder/encoders.3/self_attn/Unsqueeze_7_output_0,/encoder/encoders.30/self_attn/Gather_2_output_0,/encoder/encoders.30/self_attn/Gather_3_output_0,/encoder/encoders.30/self_attn/Unsqueeze_6_output_0,/encoder/encoders.30/self_attn/Unsqueeze_7_output_0,/encoder/encoders.31/self_attn/Gather_2_output_0,/encoder/encoders.31/self_attn/Gather_3_output_0,/encoder/encoders.31/self_attn/Unsqueeze_6_output_0,/encoder/encoders.31/self_attn/Unsqueeze_7_output_0,/encoder/encoders.32/self_attn/Gather_2_output_0,/encoder/encoders.32/self_attn/Gather_3_output_0,/encoder/encoders.32/self_attn/Unsqueeze_6_output_0,/encoder/encoders.32/self_attn/Unsqueeze_7_output_0,/encoder/encoders.33/self_attn/Gather_2_output_0,/encoder/encoders.33/self_attn/Gather_3_output_0,/encoder/encoders.33/self_attn/Unsqueeze_6_output_0,/encoder/encoders.33/self_attn/Unsqueeze_7_output_0,/encoder/encoders.34/self_attn/Gather_2_output_0,/encoder/encoders.34/self_attn/Gather_3_output_0,/encoder/encoders.34/self_attn/Unsqueeze_6_output_0,/encoder/encoders.34/self_attn/Unsqueeze_7_output_0,/encoder/encoders.35/self_attn/Gather_2_output_0,/encoder/encoders.35/self_attn/Gather_3_output_0,/encoder/encoders.35/self_attn/Unsqueeze_6_output_0,/encoder/encoders.35/self_attn/Unsqueeze_7_output_0,/encoder/encoders.36/self_attn/Gather_2_output_0,/encoder/encoders.36/self_attn/Gather_3_output_0,/encoder/encoders.36/self_attn/Unsqueeze_6_output_0,/encoder/encoders.36/self_attn/Unsqueeze_7_output_0,/encoder/encoders.37/self_attn/Gather_2_output_0,/encoder/encoders.37/self_attn/Gather_3_output_0,/encoder/encoders.37/self_attn/Unsqueeze_6_output_0,/encoder/encoders.37/self_attn/Unsqueeze_7_output_0,/encoder/encoders.38/self_attn/Gather_2_output_0,/encoder/encoders.38/self_attn/Gather_3_output_0,/encoder/encoders.38/self_attn/Unsqueeze_6_output_0,/encoder/encoders.38/self_attn/Unsqueeze_7_output_0,/encoder/encoders.39/self_attn/Gather_2_output_0,/encoder/encoders.39/self_attn/Gather_3_output_0,/encoder/encoders.39/self_attn/Unsqueeze_6_output_0,/encoder/encoders.39/self_attn/Unsqueeze_7_output_0,/encoder/encoders.4/self_attn/Gather_2_output_0,/encoder/encoders.4/self_attn/Gather_3_output_0,/encoder/encoders.4/self_attn/Unsqueeze_6_output_0,/encoder/encoders.4/self_attn/Unsqueeze_7_output_0,/encoder/encoders.40/self_attn/Gather_2_output_0,/encoder/encoders.40/self_attn/Gather_3_output_0,/encoder/encoders.40/self_attn/Unsqueeze_6_output_0,/encoder/encoders.40/self_attn/Unsqueeze_7_output_0,/encoder/encoders.41/self_attn/Gather_2_output_0,/encoder/encoders.41/self_attn/Gather_3_output_0,/encoder/encoders.41/self_attn/Unsqueeze_6_output_0,/encoder/encoders.41/self_attn/Unsqueeze_7_output_0,/encoder/encoders.42/self_attn/Gather_2_output_0,/encoder/encoders.42/self_attn/Gather_3_output_0,/encoder/encoders.42/self_attn/Unsqueeze_6_output_0,/encoder/encoders.42/self_attn/Unsqueeze_7_output_0,/encoder/encoders.43/self_attn/Gather_2_output_0,/encoder/encoders.43/self_attn/Gather_3_output_0,/encoder/encoders.43/self_attn/Unsqueeze_6_output_0,/encoder/encoders.43/self_attn/Unsqueeze_7_output_0,/encoder/encoders.44/self_attn/Gather_2_output_0,/encoder/encoders.44/self_attn/Gather_3_output_0,/encoder/encoders.44/self_attn/Unsqueeze_6_output_0,/encoder/encoders.44/self_attn/Unsqueeze_7_output_0,/encoder/encoders.45/self_attn/Gather_2_output_0,/encoder/encoders.45/self_attn/Gather_3_output_0,/encoder/encoders.45/self_attn/Unsqueeze_6_output_0,/encoder/encoders.45/self_attn/Unsqueeze_7_output_0,/encoder/encoders.46/self_attn/Gather_2_output_0,/encoder/encoders.46/self_attn/Gather_3_output_0,/encoder/encoders.46/self_attn/Unsqueeze_6_output_0,/encoder/encoders.46/self_attn/Unsqueeze_7_output_0,/encoder/encoders.47/self_attn/Gather_2_output_0,/encoder/encoders.47/self_attn/Gather_3_output_0,/encoder/encoders.47/self_attn/Unsqueeze_6_output_0,/encoder/encoders.47/self_attn/Unsqueeze_7_output_0,/encoder/encoders.48/self_attn/Gather_2_output_0,/encoder/encoders.48/self_attn/Gather_3_output_0,/encoder/encoders.48/self_attn/Unsqueeze_6_output_0,/encoder/encoders.48/self_attn/Unsqueeze_7_output_0,/encoder/encoders.5/self_attn/Gather_2_output_0,/encoder/encoders.5/self_attn/Gather_3_output_0,/encoder/encoders.5/self_attn/Unsqueeze_6_output_0,/encoder/encoders.5/self_attn/Unsqueeze_7_output_0,/encoder/encoders.6/self_attn/Gather_2_output_0,/encoder/encoders.6/self_attn/Gather_3_output_0,/encoder/encoders.6/self_attn/Unsqueeze_6_output_0,/encoder/encoders.6/self_attn/Unsqueeze_7_output_0,/encoder/encoders.7/self_attn/Gather_2_output_0,/encoder/encoders.7/self_attn/Gather_3_output_0,/encoder/encoders.7/self_attn/Unsqueeze_6_output_0,/encoder/encoders.7/self_attn/Unsqueeze_7_output_0,/encoder/encoders.8/self_attn/Gather_2_output_0,/encoder/encoders.8/self_attn/Gather_3_output_0,/encoder/encoders.8/self_attn/Unsqueeze_6_output_0,/encoder/encoders.8/self_attn/Unsqueeze_7_output_0,/encoder/encoders.9/self_attn/Gather_2_output_0,/encoder/encoders.9/self_attn/Gather_3_output_0,/encoder/encoders.9/self_attn/Unsqueeze_6_output_0,/encoder/encoders.9/self_attn/Unsqueeze_7_output_0,/encoder/encoders0.0/self_attn/Gather_2_output_0,/encoder/encoders0.0/self_attn/Gather_3_output_0,/encoder/encoders0.0/self_attn/Unsqueeze_6_output_0,/encoder/encoders0.0/self_attn/Unsqueeze_8_output_0,/encoder/tp_encoders.0/self_attn/Gather_2_output_0,/encoder/tp_encoders.0/self_attn/Gather_3_output_0,/encoder/tp_encoders.0/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.0/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.1/self_attn/Gather_2_output_0,/encoder/tp_encoders.1/self_attn/Gather_3_output_0,/encoder/tp_encoders.1/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.1/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.10/self_attn/Gather_2_output_0,/encoder/tp_encoders.10/self_attn/Gather_3_output_0,/encoder/tp_encoders.10/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.10/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.11/self_attn/Gather_2_output_0,/encoder/tp_encoders.11/self_attn/Gather_3_output_0,/encoder/tp_encoders.11/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.11/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.12/self_attn/Gather_2_output_0,/encoder/tp_encoders.12/self_attn/Gather_3_output_0,/encoder/tp_encoders.12/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.12/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.13/self_attn/Gather_2_output_0,/encoder/tp_encoders.13/self_attn/Gather_3_output_0,/encoder/tp_encoders.13/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.13/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.14/self_attn/Gather_2_output_0,/encoder/tp_encoders.14/self_attn/Gather_3_output_0,/encoder/tp_encoders.14/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.14/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.15/self_attn/Gather_2_output_0,/encoder/tp_encoders.15/self_attn/Gather_3_output_0,/encoder/tp_encoders.15/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.15/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.16/self_attn/Gather_2_output_0,/encoder/tp_encoders.16/self_attn/Gather_3_output_0,/encoder/tp_encoders.16/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.16/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.17/self_attn/Gather_2_output_0,/encoder/tp_encoders.17/self_attn/Gather_3_output_0,/encoder/tp_encoders.17/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.17/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.18/self_attn/Gather_2_output_0,/encoder/tp_encoders.18/self_attn/Gather_3_output_0,/encoder/tp_encoders.18/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.18/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.19/self_attn/Gather_2_output_0,/encoder/tp_encoders.19/self_attn/Gather_3_output_0,/encoder/tp_encoders.19/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.19/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.2/self_attn/Gather_2_output_0,/encoder/tp_encoders.2/self_attn/Gather_3_output_0,/encoder/tp_encoders.2/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.2/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.3/self_attn/Gather_2_output_0,/encoder/tp_encoders.3/self_attn/Gather_3_output_0,/encoder/tp_encoders.3/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.3/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.4/self_attn/Gather_2_output_0,/encoder/tp_encoders.4/self_attn/Gather_3_output_0,/encoder/tp_encoders.4/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.4/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.5/self_attn/Gather_2_output_0,/encoder/tp_encoders.5/self_attn/Gather_3_output_0,/encoder/tp_encoders.5/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.5/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.6/self_attn/Gather_2_output_0,/encoder/tp_encoders.6/self_attn/Gather_3_output_0,/encoder/tp_encoders.6/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.6/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.7/self_attn/Gather_2_output_0,/encoder/tp_encoders.7/self_attn/Gather_3_output_0,/encoder/tp_encoders.7/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.7/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.8/self_attn/Gather_2_output_0,/encoder/tp_encoders.8/self_attn/Gather_3_output_0,/encoder/tp_encoders.8/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.8/self_attn/Unsqueeze_7_output_0,/encoder/tp_encoders.9/self_attn/Gather_2_output_0,/encoder/tp_encoders.9/self_attn/Gather_3_output_0,/encoder/tp_encoders.9/self_attn/Unsqueeze_6_output_0,/encoder/tp_encoders.9/self_attn/Unsqueeze_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="24" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/Concat_1_output_0,/Concat_2_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/Tile" type="Tile" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>560</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/Tile_output_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/Concat_3" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>560</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>560</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="/Concat_3_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_41612_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="74402" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_41612" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/encoder/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>560</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/Mul_output_0">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>560</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="/encoder/embed/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/embed/Constant_3_output_0" />
			</output>
		</layer>
		<layer id="68" name="ShapeOf_43182" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>560</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/encoder/embed/Shape_1_output_0,/encoder/embed/Shape_output_0,/encoder/encoders0.0/self_attn/Shape_1_output_0,/encoder/encoders0.0/self_attn/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Constant_43183" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="70" name="Constant_43184" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="6" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="71" name="Gather_43185" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/encoder/embed/Gather_output_0" />
			</output>
		</layer>
		<layer id="72" name="/encoder/embed/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/embed/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="73" name="/encoder/embed/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/encoder/embed/Add_output_0,/encoder/embed/Cast_output_0" />
			</output>
		</layer>
		<layer id="74" name="/encoder/embed/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="24" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/embed/Constant_4_output_0" />
			</output>
		</layer>
		<layer id="75" name="/encoder/embed/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/encoder/embed/Range_output_0">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/encoder/embed/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="6" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/embed/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="/encoder/embed/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/encoder/embed/Unsqueeze_output_0">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/encoder/embed/Cast_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/encoder/embed/Cast_1_output_0">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/encoder/embed/Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="74404" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/encoder/embed/Constant_13_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/encoder/embed/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/encoder/embed/Reshape_1_output_0">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/encoder/embed/Constant_10_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="0" size="2" />
			<output>
				<port id="0" precision="FP16" names="/encoder/embed/Constant_10_output_0" />
			</output>
		</layer>
		<layer id="82" name="/encoder/embed/Constant_10" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="83" name="/encoder/embed/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="74428" size="8" />
			<output>
				<port id="0" precision="I64" names="/encoder/embed/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="84" name="Constant_996" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="6" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="85" name="/encoder/embed/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
